// Определение внешних переменных, используемых в семантической модели

#include <stdio.h>
#include "global.h"

//==============================================================================
// Описание имен, используемых в общем контексте
//==============================================================================

//------------------------------------------------------------------------------
// Имя для неименованного контекста (вместо пустого указателя)
static wchar_t* unknownName = L"!!!unknown!!!";

// Обращение к имени "неименованного" контекста для получения ссылки на него
wchar_t* GetUnknownName() {
  return unknownName;
}

//------------------------------------------------------------------------------
// Имя для целого типа
static wchar_t* typeIntName = L"int";

// Обращение к имени целого типа для получения ссылки на него
wchar_t* GetTypeIntName() {
  return typeIntName;
}

//==============================================================================
// Описание базовых типов данных, которые формируются только в одном экземпляре
//==============================================================================

//------------------------------------------------------------------------------
// Целочисленный тип
static struct Type.Int typeInt = {sizeof(int), 2};
// Контекст для подключения целочисленного типа
static Context.Typ contextTypeInt;

// Обращение к целочисленному типу
Type* GetTypeInt() {
  return (Type*)&typeInt;
}

//==============================================================================
// Описание типовых констант, которые формируются только в одном экземпляре
//==============================================================================

//------------------------------------------------------------------------------
// Нулевая целочисленная константа
static struct Constant.Int constIntZero;

// Обращение к нулевой целочисленной константе
Constant* GetConstIntZero() {
  constIntZero.@constValue = 0;
  return (Constant*)&constIntZero;
}

//==============================================================================
// Описание операндов, которые формируются только в одном экземпляре
//==============================================================================

//------------------------------------------------------------------------------
// Фиктивный операнд - заглушка при невозможности определить его параметры
static struct Operand unknownOperand;

// Обращение к фиктивному операнду для получения его указателя
Operand* GetUnknownOperand() {
  return &unknownOperand;
}

//------------------------------------------------------------------------------

//==============================================================================
// Описание внешних таблиц имен, которые формируются только в одном экземпляре
//==============================================================================

//------------------------------------------------------------------------------
// Таблица зарезервированных имен. Их нельзя использовать в другом контексте
static NameTable reservedNameTable;

// Получение указателя на таблицу зарезервированных имен
NameTable* GetReservedNameTable() {
  return &reservedNameTable;
}

//------------------------------------------------------------------------------
// Таблица имен глобальных имен, формируемых в программе
static NameTable globalNameTable;

// Получение указателя на таблицу глобальных имен
NameTable* GetGlobalNameTable() {
  return &globalNameTable;
}

//==============================================================================
// Необходимые начальные инициализации и завершающие действия
//==============================================================================

// Начальная инициализации таблицы зарезервированных имен
void InitReservedNameTable() {
  contextTypeInt.@ = (Type*)&typeInt;
  AddElementToNameTable(&reservedNameTable, GetTypeIntName(),
                        (Context*)&contextTypeInt);
}

//------------------------------------------------------------------------------
// Инициализация данных семантической модели
void InitGlobalData() {
  // Формирование начального состояния таблицы резервируемых имен
  InitReservedNameTable();
}
