#ifndef __global__
#define __global__
// global.h
// Объявление внешних переменных, используемых в семантической модели.

#include "operand.h"
#include "name-table.h"

//==============================================================================
// Описание имен, используемых в общем контексте
//==============================================================================

// Обращение к имени "неименованного" контекста для получения ссылки на него
wchar_t* GetUnknownName();

// Обращение к имени целого типа для получения ссылки на него
wchar_t* GetTypeIntName();

//==============================================================================
// Описание базовых типов данных, которые формируются только в одном экземпляре
//==============================================================================

// Обращение к целочисленному типу
Type* GetTypeInt();

//==============================================================================
// Описание типовых констант, которые формируются только в одном экземпляре
//==============================================================================

// Обращение к нулевой целочисленной константе
Constant* GetConstIntZero();

//==============================================================================
// Описание операндов, которые формируются только в одном экземпляре
//==============================================================================

// Обращение к фиктивному операнду для получения его указателя
Operand* GetUnknownOperand();

//==============================================================================
// Описание внешних таблиц имен, которые формируются только в одном экземпляре
//==============================================================================

// Получение указателя на таблицу зарезервированных имен
NameTable* GetReservedNameTable();

// Получение указателя на таблицу глобальных имен
NameTable* GetGlobalNameTable();

//==============================================================================
// Необходимые начальные инициализации и завершающие действия
//==============================================================================

// Начальная инициализации таблицы зарезервированных имен
void InitReservedNameTable();

// Инициализация данных семантической модели
void InitGlobalData();
#endif // __global__
