// Определения функций, обеспечивающих обработку типов.

#include "type-spec.h"

//==============================================================================
// Обобщенные функции для обработки типа
//==============================================================================

//------------------------------------------------------------------------------
// Функция вывода значения целочисленного типа
void DebugOutOfType<struct Type* type>(FILE* file) {
  fprintf(file, "Unknown type\n");
}

//==============================================================================
// Функции для обработки целочисленного типа
//==============================================================================

//------------------------------------------------------------------------------
// Функция вывода значения целочисленного типа
void DebugOutOfType<struct Type<integer>* pType>(FILE* file) {
  printf("Check point: type int ---> ");
  fprintf(file, "type int, size = %d\n", pType->size);
}
